Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1064das169.h
extern volatile __GLCDCLUT205bits_t GLCDCLUT205bits __asm__ ("GLCDCLUT205") __attribute__((section("sfrs"), address(0xBF8EA734)));
#define GLCDCLUT206 GLCDCLUT206
extern volatile uint32_t   GLCDCLUT206 __attribute__((section("sfrs"), address(0xBF8EA738)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT206bits_t;
extern volatile __GLCDCLUT206bits_t GLCDCLUT206bits __asm__ ("GLCDCLUT206") __attribute__((section("sfrs"), address(0xBF8EA738)));
#define GLCDCLUT207 GLCDCLUT207
extern volatile uint32_t   GLCDCLUT207 __attribute__((section("sfrs"), address(0xBF8EA73C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT207bits_t;
extern volatile __GLCDCLUT207bits_t GLCDCLUT207bits __asm__ ("GLCDCLUT207") __attribute__((section("sfrs"), address(0xBF8EA73C)));
#define GLCDCLUT208 GLCDCLUT208
extern volatile uint32_t   GLCDCLUT208 __attribute__((section("sfrs"), address(0xBF8EA740)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT208bits_t;
extern volatile __GLCDCLUT208bits_t GLCDCLUT208bits __asm__ ("GLCDCLUT208") __attribute__((section("sfrs"), address(0xBF8EA740)));
#define GLCDCLUT209 GLCDCLUT209
extern volatile uint32_t   GLCDCLUT209 __attribute__((section("sfrs"), address(0xBF8EA744)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT209bits_t;
extern volatile __GLCDCLUT209bits_t GLCDCLUT209bits __asm__ ("GLCDCLUT209") __attribute__((section("sfrs"), address(0xBF8EA744)));
#define GLCDCLUT210 GLCDCLUT210
extern volatile uint32_t   GLCDCLUT210 __attribute__((section("sfrs"), address(0xBF8EA748)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT210bits_t;
extern volatile __GLCDCLUT210bits_t GLCDCLUT210bits __asm__ ("GLCDCLUT210") __attribute__((section("sfrs"), address(0xBF8EA748)));
#define GLCDCLUT211 GLCDCLUT211
extern volatile uint32_t   GLCDCLUT211 __attribute__((section("sfrs"), address(0xBF8EA74C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT211bits_t;
extern volatile __GLCDCLUT211bits_t GLCDCLUT211bits __asm__ ("GLCDCLUT211") __attribute__((section("sfrs"), address(0xBF8EA74C)));
#define GLCDCLUT212 GLCDCLUT212
extern volatile uint32_t   GLCDCLUT212 __attribute__((section("sfrs"), address(0xBF8EA750)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT212bits_t;
extern volatile __GLCDCLUT212bits_t GLCDCLUT212bits __asm__ ("GLCDCLUT212") __attribute__((section("sfrs"), address(0xBF8EA750)));
#define GLCDCLUT213 GLCDCLUT213
extern volatile uint32_t   GLCDCLUT213 __attribute__((section("sfrs"), address(0xBF8EA754)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT213bits_t;
extern volatile __GLCDCLUT213bits_t GLCDCLUT213bits __asm__ ("GLCDCLUT213") __attribute__((section("sfrs"), address(0xBF8EA754)));
#define GLCDCLUT214 GLCDCLUT214
extern volatile uint32_t   GLCDCLUT214 __attribute__((section("sfrs"), address(0xBF8EA758)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT214bits_t;
extern volatile __GLCDCLUT214bits_t GLCDCLUT214bits __asm__ ("GLCDCLUT214") __attribute__((section("sfrs"), address(0xBF8EA758)));
#define GLCDCLUT215 GLCDCLUT215
extern volatile uint32_t   GLCDCLUT215 __attribute__((section("sfrs"), address(0xBF8EA75C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT215bits_t;
extern volatile __GLCDCLUT215bits_t GLCDCLUT215bits __asm__ ("GLCDCLUT215") __attribute__((section("sfrs"), address(0xBF8EA75C)));
#define GLCDCLUT216 GLCDCLUT216
extern volatile uint32_t   GLCDCLUT216 __attribute__((section("sfrs"), address(0xBF8EA760)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT216bits_t;
extern volatile __GLCDCLUT216bits_t GLCDCLUT216bits __asm__ ("GLCDCLUT216") __attribute__((section("sfrs"), address(0xBF8EA760)));
#define GLCDCLUT217 GLCDCLUT217
extern volatile uint32_t   GLCDCLUT217 __attribute__((section("sfrs"), address(0xBF8EA764)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT217bits_t;
extern volatile __GLCDCLUT217bits_t GLCDCLUT217bits __asm__ ("GLCDCLUT217") __attribute__((section("sfrs"), address(0xBF8EA764)));
#define GLCDCLUT218 GLCDCLUT218
extern volatile uint32_t   GLCDCLUT218 __attribute__((section("sfrs"), address(0xBF8EA768)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT218bits_t;
extern volatile __GLCDCLUT218bits_t GLCDCLUT218bits __asm__ ("GLCDCLUT218") __attribute__((section("sfrs"), address(0xBF8EA768)));
#define GLCDCLUT219 GLCDCLUT219
extern volatile uint32_t   GLCDCLUT219 __attribute__((section("sfrs"), address(0xBF8EA76C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT219bits_t;
extern volatile __GLCDCLUT219bits_t GLCDCLUT219bits __asm__ ("GLCDCLUT219") __attribute__((section("sfrs"), address(0xBF8EA76C)));
#define GLCDCLUT220 GLCDCLUT220
extern volatile uint32_t   GLCDCLUT220 __attribute__((section("sfrs"), address(0xBF8EA770)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT220bits_t;
extern volatile __GLCDCLUT220bits_t GLCDCLUT220bits __asm__ ("GLCDCLUT220") __attribute__((section("sfrs"), address(0xBF8EA770)));
#define GLCDCLUT221 GLCDCLUT221
extern volatile uint32_t   GLCDCLUT221 __attribute__((section("sfrs"), address(0xBF8EA774)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT221bits_t;
extern volatile __GLCDCLUT221bits_t GLCDCLUT221bits __asm__ ("GLCDCLUT221") __attribute__((section("sfrs"), address(0xBF8EA774)));
#define GLCDCLUT222 GLCDCLUT222
extern volatile uint32_t   GLCDCLUT222 __attribute__((section("sfrs"), address(0xBF8EA778)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT222bits_t;
